rob-zeno/hal_nxp/s32/mcux/devices/S32K312/S32K312_device.h
/*
 * Copyright 2023 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _S32K312_DEVICE_H_
#define _S32K312_DEVICE_H_

/* ----------------------------------------------------------------------------
   -- CAN Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CAN_Peripheral_Access_Layer CAN Peripheral Access Layer
 * @{
 */

/** CAN - Register Layout Typedef */
typedef struct {
        __IO uint32_t MCR;                  /**< Module Configuration Register, offset: 0x0 */
        __IO uint32_t CTRL1;                /**< Control 1 Register, offset: 0x4 */
        __IO uint32_t TIMER;                /**< Free Running Timer, offset: 0x8 */
        uint8_t RESERVED_0[4];
        __IO uint32_t RXMGMASK;             /**< Rx Mailboxes Global Mask Register, offset: 0x10 */
        __IO uint32_t RX14MASK;             /**< Rx 14 Mask Register, offset: 0x14 */
        __IO uint32_t RX15MASK;             /**< Rx 15 Mask Register, offset: 0x18 */
        __IO uint32_t ECR;                  /**< Error Counter, offset: 0x1C */
        __IO uint32_t ESR1;                 /**< Error and Status 1 Register, offset: 0x20 */
        __IO uint32_t IMASK2;               /**< Interrupt Masks 2 Register, offset: 0x24 */
        __IO uint32_t IMASK1;               /**< Interrupt Masks 1 Register, offset: 0x28 */
        __IO uint32_t IFLAG2;               /**< Interrupt Flags 2 Register, offset: 0x2C */
        __IO uint32_t IFLAG1;               /**< Interrupt Flags 1 Register, offset: 0x30 */
        __IO uint32_t CTRL2;                /**< Control 2 Register, offset: 0x34 */
        __I  uint32_t ESR2;                 /**< Error and Status 2 Register, offset: 0x38 */
        uint8_t RESERVED_1[8];
        __I  uint32_t CRCR;                 /**< CRC Register, offset: 0x44 */
        __IO uint32_t RXFGMASK;             /**< Legacy Rx FIFO Global Mask Register..Rx FIFO Global Mask Register, offset: 0x48 */
        __I  uint32_t RXFIR;                /**< Legacy Rx FIFO Information Register..Rx FIFO Information Register, offset: 0x4C */
        __IO uint32_t CBT;                  /**< CAN Bit Timing Register, offset: 0x50 */
        uint8_t RESERVED_2[24];
#if 0
        __IO uint32_t IMASK3;               /**< Interrupt Masks 3 Register, offset: 0x6C */
#else
		uint32_t RESERVED_NO_IMASK3;
#endif
        uint8_t RESERVED_3[4];
#if 0
        __IO uint32_t IFLAG3;               /**< Interrupt Flags 3 Register, offset: 0x74 */
#else
		uint32_t RESERVED_NO_IFLAG3;
#endif
        uint8_t RESERVED_4[8];
        union
        {
        struct
        {                                   /* offset: 0x80, array step: 0x10 */
                __IO uint32_t CS;           /**< Message Buffer 0 CS Register..Message Buffer 95 CS Register, array offset: 0x80, array step: 0x10 */
                __IO uint32_t ID;           /**< Message Buffer 0 ID Register..Message Buffer 95 ID Register, array offset: 0x84, array step: 0x10 */
                __IO uint32_t WORD[2];      /**< Message Buffer 0 WORD_8B Register..Message Buffer 95 WORD_8B Register, array offset: 0x88, array step: index*0x10, index2*0x4 */
        } MB_8B[96];
        struct
        {                                   /* offset: 0x80, array step: 0x18 */
                __IO uint32_t CS;           /**< Message Buffer 0 CS Register..Message Buffer 62 CS Register, array offset: 0x80, array step: 0x18 */
                __IO uint32_t ID;           /**< Message Buffer 0 ID Register..Message Buffer 62 ID Register, array offset: 0x84, array step: 0x18 */
                __IO uint32_t WORD[4];      /**< Message Buffer 0 WORD_16B Register..Message Buffer 62 WORD_16B Register, array offset: 0x88, array step: index*0x18, index2*0x4 */
        } MB_16B[63];
        struct
        {                                   /* offset: 0x80, array step: 0x28 */
                __IO uint32_t CS;           /**< Message Buffer 0 CS Register..Message Buffer 35 CS Register, array offset: 0x80, array step: 0x28 */
                __IO uint32_t ID;           /**< Message Buffer 0 ID Register..Message Buffer 35 ID Register, array offset: 0x84, array step: 0x28 */
                __IO uint32_t WORD[8];      /**< Message Buffer 0 WORD_32B Register..Message Buffer 35 WORD_32B Register, array offset: 0x88, array step: index*0x28, index2*0x4 */
        } MB_32B[36];
        struct
        {                                   /* offset: 0x80, array step: 0x48 */
                __IO uint32_t CS;           /**< Message Buffer 0 CS Register..Message Buffer 20 CS Register, array offset: 0x80, array step: 0x48 */
                __IO uint32_t ID;           /**< Message Buffer 0 ID Register..Message Buffer 20 ID Register, array offset: 0x84, array step: 0x48 */
                __IO uint32_t WORD[16];     /**< Message Buffer 0 WORD_64B Register..Message Buffer 20 WORD_64B Register, array offset: 0x88, array step: index*0x48, index2*0x4 */
        } MB_64B[21];
        struct
        {                                   /* offset: 0x80, array step: 0x10 */
                __IO uint32_t CS;           /**< Message Buffer 0 CS Register..Message Buffer 95 CS Register, array offset: 0x80, array step: 0x10 */
                __IO uint32_t ID;           /**< Message Buffer 0 ID Register..Message Buffer 95 ID Register, array offset: 0x84, array step: 0x10 */
                __IO uint32_t WORD0;        /**< Message Buffer 0 WORD0 Register..Message Buffer 95 WORD0 Register, array offset: 0x88, array step: 0x10 */
                __IO uint32_t WORD1;        /**< Message Buffer 0 WORD1 Register..Message Buffer 95 WORD1 Register, array offset: 0x8C, array step: 0x10 */
        } MB[96];
        };
        uint8_t RESERVED_5[512];
        __IO uint32_t RXIMR[96];            /**< Rx Individual Mask Registers, array offset: 0x880, array step: 0x4 */
        uint8_t RESERVED_6[224];
        __IO uint32_t MECR;                 /**< Memory Error Control Register, offset: 0xAE0 */
        __IO uint32_t ERRIAR;               /**< Error Injection Address Register, offset: 0xAE4 */
        __IO uint32_t ERRIDPR;              /**< Error Injection Data Pattern Register, offset: 0xAE8 */
        __IO uint32_t ERRIPPR;              /**< Error Injection Parity Pattern Register, offset: 0xAEC */
        __I  uint32_t RERRAR;               /**< Error Report Address Register, offset: 0xAF0 */
        __I  uint32_t RERRDR;               /**< Error Report Data Register, offset: 0xAF4 */
        __I  uint32_t RERRSYNR;             /**< Error Report Syndrome Register, offset: 0xAF8 */
        __IO uint32_t ERRSR;                /**< Error Status Register, offset: 0xAFC */
        uint8_t RESERVED_7[240];
        __IO uint32_t EPRS;                 /**< Enhanced CAN Bit Timing Prescalers, offset: 0xBF0 */
        __IO uint32_t ENCBT;                /**< Enhanced Nominal CAN Bit Timing, offset: 0xBF4 */
        __IO uint32_t EDCBT;                /**< Enhanced Data Phase CAN bit Timing, offset: 0xBF8 */
        __IO uint32_t ETDC;                 /**< Enhanced Transceiver Delay Compensation, offset: 0xBFC */
        __IO uint32_t FDCTRL;               /**< CAN FD Control Register, offset: 0xC00 */
        __IO uint32_t FDCBT;                /**< CAN FD Bit Timing Register, offset: 0xC04 */
        __I  uint32_t FDCRC;                /**< CAN FD CRC Register, offset: 0xC08 */
        __IO uint32_t ERFCR;                /**< Enhanced Rx FIFO Control Register, offset: 0xC0C */
        __IO uint32_t ERFIER;               /**< Enhanced Rx FIFO Interrupt Enable Register, offset: 0xC10 */
        __IO uint32_t ERFSR;                /**< Enhanced Rx FIFO Status Register, offset: 0xC14 */
        uint8_t RESERVED_8[24];
#if 0
        __IO uint32_t HR_TIME_STAMP[96];    /**< High Resolution Time Stamp, array offset: 0xC30, array step: 0x4 */
        uint8_t RESERVED_9[8784];
#else
        __IO uint32_t HR_TIME_STAMP[FLEXCAN_HR_TIME_STAMP_COUNT];    /**< High Resolution Time Stamp, array offset: 0xC30, array step: 0x4 */
        uint8_t RESERVED_9[8912];
#endif
        __IO uint32_t ERFFEL[FLEXCAN_ERFFEL_COUNT];          /**< Enhanced Rx FIFO Filter Element, array offset: 0x3000, array step: 0x4 */
} CAN_Type;

/* ----------------------------------------------------------------------------
   -- CAN Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CAN_Register_Masks CAN Register Masks
 * @{
 */

/*! @name MCR - Module Configuration Register */
/*! @{ */

