rob-zeno/hal_nxp/s32/mcux/devices/S32K312/S32K312_device.h
#define DMA_MP_CSR_EDBG(x)                  eDMA_CSR_EDBG(x)

#define DMA_MP_CSR_ERCA_MASK                eDMA_CSR_ERCA_MASK
#define DMA_MP_CSR_ERCA_SHIFT               eDMA_CSR_ERCA_SHIFT
#define DMA_MP_CSR_ERCA(x)                  eDMA_CSR_ERCA(x)

#define DMA_MP_CSR_HAE_MASK                 eDMA_CSR_HAE_MASK
#define DMA_MP_CSR_HAE_SHIFT                eDMA_CSR_HAE_SHIFT
#define DMA_MP_CSR_HAE(x)                   eDMA_CSR_HAE(x)

#define DMA_MP_CSR_HALT_MASK                eDMA_CSR_HALT_MASK
#define DMA_MP_CSR_HALT_SHIFT               eDMA_CSR_HALT_SHIFT
#define DMA_MP_CSR_HALT(x)                  eDMA_CSR_HALT(x)

#define DMA_MP_CSR_GCLC_MASK                eDMA_CSR_GCLC_MASK
#define DMA_MP_CSR_GCLC_SHIFT               eDMA_CSR_GCLC_SHIFT
#define DMA_MP_CSR_GCLC(x)                  eDMA_CSR_GCLC(x)

#define DMA_MP_CSR_GMRC_MASK                eDMA_CSR_GMRC_MASK
#define DMA_MP_CSR_GMRC_SHIFT               eDMA_CSR_GMRC_SHIFT
#define DMA_MP_CSR_GMRC(x)                  eDMA_CSR_GMRC(x)

#define DMA_MP_CSR_ECX_MASK                 eDMA_CSR_ECX_MASK
#define DMA_MP_CSR_ECX_SHIFT                eDMA_CSR_ECX_SHIFT
#define DMA_MP_CSR_ECX(x)                   eDMA_CSR_ECX(x)

#define DMA_MP_CSR_CX_MASK                  eDMA_CSR_CX_MASK
#define DMA_MP_CSR_CX_SHIFT                 eDMA_CSR_CX_SHIFT
#define DMA_MP_CSR_CX(x)                    eDMA_CSR_CX(x)

#define DMA_MP_CSR_ACTIVE_ID_MASK           eDMA_CSR_ACTIVE_ID_MASK
#define DMA_MP_CSR_ACTIVE_ID_SHIFT          eDMA_CSR_ACTIVE_ID_SHIFT
#define DMA_MP_CSR_ACTIVE_ID(x)             eDMA_CSR_ACTIVE_ID(x)

#define DMA_MP_CSR_ACTIVE_MASK              eDMA_CSR_ACTIVE_MASK
#define DMA_MP_CSR_ACTIVE_SHIFT             eDMA_CSR_ACTIVE_SHIFT
#define DMA_MP_CSR_ACTIVE(x)                eDMA_CSR_ACTIVE(x)
/*! @} */

/*! @name MP_ES - Management Page Error Status */
/*! @{ */

#define DMA_MP_ES_DBE_MASK                  eDMA_ES_DBE_MASK
#define DMA_MP_ES_DBE_SHIFT                 eDMA_ES_DBE_SHIFT
#define DMA_MP_ES_DBE(x)                    eDMA_ES_DBE(x)

#define DMA_MP_ES_SBE_MASK                  eDMA_ES_SBE_MASK
#define DMA_MP_ES_SBE_SHIFT                 eDMA_ES_SBE_SHIFT
#define DMA_MP_ES_SBE(x)                    eDMA_ES_SBE(x)

#define DMA_MP_ES_SGE_MASK                  eDMA_ES_SGE_MASK
#define DMA_MP_ES_SGE_SHIFT                 eDMA_ES_SGE_SHIFT
#define DMA_MP_ES_SGE(x)                    eDMA_ES_SGE(x)

#define DMA_MP_ES_NCE_MASK                  eDMA_ES_NCE_MASK
#define DMA_MP_ES_NCE_SHIFT                 eDMA_ES_NCE_SHIFT
#define DMA_MP_ES_NCE(x)                    eDMA_ES_NCE(x)

#define DMA_MP_ES_DOE_MASK                  eDMA_ES_DOE_MASK
#define DMA_MP_ES_DOE_SHIFT                 eDMA_ES_DOE_SHIFT
#define DMA_MP_ES_DOE(x)                    eDMA_ES_DOE(x)

#define DMA_MP_ES_DAE_MASK                  eDMA_ES_DAE_MASK
#define DMA_MP_ES_DAE_SHIFT                 eDMA_ES_DAE_SHIFT
#define DMA_MP_ES_DAE(x)                    eDMA_ES_DAE(x)

#define DMA_MP_ES_SOE_MASK                  eDMA_ES_SOE_MASK
#define DMA_MP_ES_SOE_SHIFT                 eDMA_ES_SOE_SHIFT
#define DMA_MP_ES_SOE(x)                    eDMA_ES_SOE(x)

#define DMA_MP_ES_SAE_MASK                  eDMA_ES_SAE_MASK
#define DMA_MP_ES_SAE_SHIFT                 eDMA_ES_SAE_SHIFT
#define DMA_MP_ES_SAE(x)                    eDMA_ES_SAE(x)

#define DMA_MP_ES_ECX_MASK                  eDMA_ES_ECX_MASK
#define DMA_MP_ES_ECX_SHIFT                 eDMA_ES_ECX_SHIFT
#define DMA_MP_ES_ECX(x)                    eDMA_ES_ECX(x)

// missing DMA_ES_UCE_MASK UCX???

#define DMA_MP_ES_ERRCHN_MASK               eDMA_ES_ERRCHN_MASK
#define DMA_MP_ES_ERRCHN_SHIFT              eDMA_ES_ERRCHN_SHIFT
#define DMA_MP_ES_ERRCHN(x)                 eDMA_ES_ERRCHN(x)

#define DMA_MP_ES_VLD_MASK                  eDMA_ES_VLD_MASK
#define DMA_MP_ES_VLD_SHIFT                 eDMA_ES_VLD_SHIFT
#define DMA_MP_ES_VLD(x)                    eDMA_ES_VLD(x)

/*! @} */

/*! @name MP_INT - Management Page Interrupt Request Status */
/*! @{ */

#define DMA_MP_INT_INT_MASK                 eDMA_INT_INT_MASK
#define DMA_MP_INT_INT_SHIFT                eDMA_INT_INT_SHIFT
#define DMA_MP_INT_INT(x)                   eDMA_INT_INT(x)

/*! @} */

/*! @name MP_HRS - Management Page Hardware Request Status */
/*! @{ */

#define DMA_MP_HRS_HRS_MASK                 eDMA_HRS_HRS_MASK
#define DMA_MP_HRS_HRS_SHIFT                eDMA_HRS_HRS_SHIFT
#define DMA_MP_HRS_HRS(x)                   eDMA_HRS_HRS(x)
/*! @} */

/*! @name CH_GRPRI - Channel Arbitration Group */
/*! @{ */

#if 0
#define DMA_CH_GRPRI_GRPRI_MASK             eDMA_CH_GRPRI_GRPRI_MASK
#define DMA_CH_GRPRI_GRPRI_SHIFT            eDMA_CH_GRPRI_GRPRI_SHIFT
#define DMA_CH_GRPRI_GRPRI(x)               eDMA_CH_GRPRI_GRPRI(x)
#endif
/*! @} */

/*! @name CH_CSR - Channel Control and Status */
/*! @{ */

#define DMA_CH_CSR_ERQ_MASK                 DMA_TCD_CH0_CSR_ERQ_MASK
#define DMA_CH_CSR_ERQ_SHIFT                DMA_TCD_CH0_CSR_ERQ_SHIFT
#define DMA_CH_CSR_ERQ(x)                   DMA_TCD_CH0_CSR_ERQ(x)

#define DMA_CH_CSR_EARQ_MASK                DMA_TCD_CH0_CSR_EARQ_MASK
#define DMA_CH_CSR_EARQ_SHIFT               DMA_TCD_CH0_CSR_EARQ_SHIFT
#define DMA_CH_CSR_EARQ(x)                  DMA_TCD_CH0_CSR_EARQ(x)

#define DMA_CH_CSR_EEI_MASK                 DMA_TCD_CH0_CSR_EEI_MASK
#define DMA_CH_CSR_EEI_SHIFT                DMA_TCD_CH0_CSR_EEI_SHIFT
#define DMA_CH_CSR_EEI(x)                   DMA_TCD_CH0_CSR_EEI(x)

#define DMA_CH_CSR_EBW_MASK                 DMA_TCD_CH0_CSR_EBW_MASK
#define DMA_CH_CSR_EBW_SHIFT                DMA_TCD_CH0_CSR_EBW_SHIFT
#define DMA_CH_CSR_EBW(x)                   DMA_TCD_CH0_CSR_EBW(x)

#define DMA_CH_CSR_DONE_MASK                DMA_TCD_CH0_CSR_DONE_MASK
#define DMA_CH_CSR_DONE_SHIFT               DMA_TCD_CH0_CSR_DONE_SHIFT
#define DMA_CH_CSR_DONE(x)                  DMA_TCD_CH0_CSR_DONE(x)

#define DMA_CH_CSR_ACTIVE_MASK              DMA_TCD_CH0_CSR_ACTIVE_MASK
#define DMA_CH_CSR_ACTIVE_SHIFT             DMA_TCD_CH0_CSR_ACTIVE_SHIFT
#define DMA_CH_CSR_ACTIVE(x)                DMA_TCD_CH0_CSR_ACTIVE(x)
/*! @} */

