rob-zeno/hal_nxp/s32/mcux/devices/S32K312/S32K312_device.h
/*! @name CH_ES - Channel Error Status */
/*! @{ */

#define DMA_CH_ES_DBE_MASK                  DMA_TCD_CH0_ES_DBE_MASK
#define DMA_CH_ES_DBE_SHIFT                 DMA_TCD_CH0_ES_DBE_SHIFT
#define DMA_CH_ES_DBE(x)                    DMA_TCD_CH0_ES_DBE(x)

#define DMA_CH_ES_SBE_MASK                  DMA_TCD_CH0_ES_SBE_MASK
#define DMA_CH_ES_SBE_SHIFT                 DMA_TCD_CH0_ES_SBE_SHIFT
#define DMA_CH_ES_SBE(x)                    DMA_TCD_CH0_ES_SBE(x)

#define DMA_CH_ES_SGE_MASK                  DMA_TCD_CH0_ES_SGE_MASK
#define DMA_CH_ES_SGE_SHIFT                 DMA_TCD_CH0_ES_SGE_SHIFT
#define DMA_CH_ES_SGE(x)                    DMA_TCD_CH0_ES_SGE(x)

#define DMA_CH_ES_NCE_MASK                  DMA_TCD_CH0_ES_NCE_MASK
#define DMA_CH_ES_NCE_SHIFT                 DMA_TCD_CH0_ES_NCE_SHIFT
#define DMA_CH_ES_NCE(x)                    DMA_TCD_CH0_ES_NCE(x)

#define DMA_CH_ES_DOE_MASK                  DMA_TCD_CH0_ES_DOE_MASK
#define DMA_CH_ES_DOE_SHIFT                 DMA_TCD_CH0_ES_DOE_SHIFT
#define DMA_CH_ES_DOE(x)                    DMA_TCD_CH0_ES_DOE(x)

#define DMA_CH_ES_DAE_MASK                  DMA_TCD_CH0_ES_DAE_MASK
#define DMA_CH_ES_DAE_SHIFT                 DMA_TCD_CH0_ES_DAE_SHIFT
#define DMA_CH_ES_DAE(x)                    DMA_TCD_CH0_ES_DAE(x)

#define DMA_CH_ES_SOE_MASK                  DMA_TCD_CH0_ES_SOE_MASK
#define DMA_CH_ES_SOE_SHIFT                 DMA_TCD_CH0_ES_SOE_SHIFT
#define DMA_CH_ES_SOE(x)                    DMA_TCD_CH0_ES_SOE(x)

#define DMA_CH_ES_SAE_MASK                  DMA_TCD_CH0_ES_SAE_MASK
#define DMA_CH_ES_SAE_SHIFT                 DMA_TCD_CH0_ES_SAE_SHIFT
#define DMA_CH_ES_SAE(x)                    DMA_TCD_CH0_ES_SAE(x)

#define DMA_CH_ES_ERR_MASK                  DMA_TCD_CH0_ES_ERR_MASK
#define DMA_CH_ES_ERR_SHIFT                 DMA_TCD_CH0_ES_ERR_SHIFT
#define DMA_CH_ES_ERR(x)                    DMA_TCD_CH0_ES_ERR(x)
/*! @} */

/*! @name CH_INT - Channel Interrupt Status */
/*! @{ */

#define DMA_CH_INT_INT_MASK                 DMA_TCD_CH0_INT_INT_MASK
#define DMA_CH_INT_INT_SHIFT                DMA_TCD_CH0_INT_INT_SHIFT
#define DMA_CH_INT_INT(x)                   DMA_TCD_CH0_INT_INT(x)
/*! @} */

/*! @name CH_SBR - Channel System Bus */
/*! @{ */

#define DMA_CH_SBR_MID_MASK                 DMA_TCD_CH0_SBR_MID_MASK
#define DMA_CH_SBR_MID_SHIFT                DMA_TCD_CH0_SBR_MID_SHIFT
#define DMA_CH_SBR_MID(x)                   DMA_TCD_CH0_SBR_MID(x)

#define DMA_CH_SBR_PAL_MASK                 DMA_TCD_CH0_SBR_PAL_MASK
#define DMA_CH_SBR_PAL_SHIFT                DMA_TCD_CH0_SBR_PAL_SHIFT
#define DMA_CH_SBR_PAL(x)                   DMA_TCD_CH0_SBR_PAL(x)

#define DMA_CH_SBR_EMI_MASK                 DMA_TCD_CH0_SBR_EMI_MASK
#define DMA_CH_SBR_EMI_SHIFT                DMA_TCD_CH0_SBR_EMI_SHIFT
#define DMA_CH_SBR_EMI(x)                   DMA_TCD_CH0_SBR_EMI(x)

#define DMA_CH_SBR_ATTR_MASK                DMA_TCD_CH0_SBR_ATTR_MASK
#define DMA_CH_SBR_ATTR_SHIFT               DMA_TCD_CH0_SBR_ATTR_SHIFT
#define DMA_CH_SBR_ATTR(x)                  DMA_TCD_CH0_SBR_ATTR(x)
/*! @} */

/*! @name CH_PRI - Channel Priority */
/*! @{ */

#define DMA_CH_PRI_APL_MASK                 DMA_TCD_CH0_PRI_APL_MASK
#define DMA_CH_PRI_APL_SHIFT                DMA_TCD_CH0_PRI_APL_SHIFT
#define DMA_CH_PRI_APL(x)                   DMA_TCD_CH0_PRI_APL(x)

#define DMA_CH_PRI_DPA_MASK                 DMA_TCD_CH0_PRI_DPA_MASK
#define DMA_CH_PRI_DPA_SHIFT                DMA_TCD_CH0_PRI_DPA_SHIFT
#define DMA_CH_PRI_DPA(x)                   DMA_TCD_CH0_PRI_DPA(x)

#define DMA_CH_PRI_ECP_MASK                 DMA_TCD_CH0_PRI_ECP_MASK
#define DMA_CH_PRI_ECP_SHIFT                DMA_TCD_CH0_PRI_ECP_SHIFT
#define DMA_CH_PRI_ECP(x)                   DMA_TCD_CH0_PRI_ECP(x)
/*! @} */

/*! @name TCD_SADDR - TCD Source Address */
/*! @{ */

#define DMA_TCD_SADDR_SADDR_MASK            DMA_TCD_TCD0_SADDR_SADDR_MASK
#define DMA_TCD_SADDR_SADDR_SHIFT           DMA_TCD_TCD0_SADDR_SADDR_SHIFT
#define DMA_TCD_SADDR_SADDR(x)              DMA_TCD_TCD0_SADDR_SADDR(x)
/*! @} */

/*! @name TCD_SOFF - TCD Signed Source Address Offset */
/*! @{ */

#define DMA_TCD_SOFF_SOFF_MASK              DMA_TCD_TCD0_SOFF_SOFF_MASK
#define DMA_TCD_SOFF_SOFF_SHIFT             DMA_TCD_TCD0_SOFF_SOFF_SHIFT
#define DMA_TCD_SOFF_SOFF(x)                DMA_TCD_TCD0_SOFF_SOFF(x)
/*! @} */

/*! @name TCD_ATTR - TCD Transfer Attributes */
/*! @{ */

#define DMA_TCD_ATTR_DSIZE_MASK             DMA_TCD_TCD0_ATTR_DSIZE_MASK
#define DMA_TCD_ATTR_DSIZE_SHIFT            DMA_TCD_TCD0_ATTR_DSIZE_SHIFT
#define DMA_TCD_ATTR_DSIZE(x)               DMA_TCD_TCD0_ATTR_DSIZE(x)

#define DMA_TCD_ATTR_DMOD_MASK              DMA_TCD_TCD0_ATTR_DMOD_MASK
#define DMA_TCD_ATTR_DMOD_SHIFT             DMA_TCD_TCD0_ATTR_DMOD_SHIFT
#define DMA_TCD_ATTR_DMOD(x)                DMA_TCD_TCD0_ATTR_DMOD(x)

#define DMA_TCD_ATTR_SSIZE_MASK             DMA_TCD_TCD0_ATTR_SSIZE_MASK
#define DMA_TCD_ATTR_SSIZE_SHIFT            DMA_TCD_TCD0_ATTR_SSIZE_SHIFT
#define DMA_TCD_ATTR_SSIZE(x)               DMA_TCD_TCD0_ATTR_SSIZE(x)

#define DMA_TCD_ATTR_SMOD_MASK              DMA_TCD_TCD0_ATTR_SMOD_MASK
#define DMA_TCD_ATTR_SMOD_SHIFT             DMA_TCD_TCD0_ATTR_SMOD_SHIFT
#define DMA_TCD_ATTR_SMOD(x)                DMA_TCD_TCD0_ATTR_SMOD(x)
/*! @} */

/*! @name TCD_NBYTES_MLOFFNO - TCD Transfer Size Without Minor Loop Offsets */
/*! @{ */

#define DMA_TCD_NBYTES_MLOFFNO_NBYTES_MASK  DMA_TCD_TCD0_NBYTES_MLOFFNO_NBYTES_MASK
#define DMA_TCD_NBYTES_MLOFFNO_NBYTES_SHIFT DMA_TCD_TCD0_NBYTES_MLOFFNO_NBYTES_SHIFT
#define DMA_TCD_NBYTES_MLOFFNO_NBYTES(x)    DMA_TCD_TCD0_NBYTES_MLOFFNO_NBYTES(x)

#define DMA_TCD_NBYTES_MLOFFNO_DMLOE_MASK   DMA_TCD_TCD0_NBYTES_MLOFFNO_DMLOE_MASK
#define DMA_TCD_NBYTES_MLOFFNO_DMLOE_SHIFT  DMA_TCD_TCD0_NBYTES_MLOFFNO_DMLOE_SHIFT
#define DMA_TCD_NBYTES_MLOFFNO_DMLOE(x)     DMA_TCD_TCD0_NBYTES_MLOFFNO_DMLOE(x)

#define DMA_TCD_NBYTES_MLOFFNO_SMLOE_MASK   DMA_TCD_TCD0_NBYTES_MLOFFNO_SMLOE_MASK
#define DMA_TCD_NBYTES_MLOFFNO_SMLOE_SHIFT  DMA_TCD_TCD0_NBYTES_MLOFFNO_SMLOE_SHIFT
#define DMA_TCD_NBYTES_MLOFFNO_SMLOE(x)     DMA_TCD_TCD0_NBYTES_MLOFFNO_SMLOE(x)
/*! @} */

/*! @name TCD_NBYTES_MLOFFYES - TCD Transfer Size with Minor Loop Offsets */
/*! @{ */

#define DMA_TCD_NBYTES_MLOFFYES_NBYTES_MASK  DMA_TCD_TCD0_NBYTES_MLOFFYES_NBYTES_MASK
#define DMA_TCD_NBYTES_MLOFFYES_NBYTES_SHIFT DMA_TCD_TCD0_NBYTES_MLOFFYES_NBYTES_SHIFT
#define DMA_TCD_NBYTES_MLOFFYES_NBYTES(x)    DMA_TCD_TCD0_NBYTES_MLOFFYES_NBYTES(x)

#define DMA_TCD_NBYTES_MLOFFYES_MLOFF_MASK  DMA_TCD_TCD0_NBYTES_MLOFFYES_MLOFF_MASK
#define DMA_TCD_NBYTES_MLOFFYES_MLOFF_SHIFT DMA_TCD_TCD0_NBYTES_MLOFFYES_MLOFF_SHIFT
#define DMA_TCD_NBYTES_MLOFFYES_MLOFF(x)    DMA_TCD_TCD0_NBYTES_MLOFFYES_MLOFF(x)

#define DMA_TCD_NBYTES_MLOFFYES_DMLOE_MASK  DMA_TCD_TCD0_NBYTES_MLOFFYES_DMLOE_MASK
#define DMA_TCD_NBYTES_MLOFFYES_DMLOE_SHIFT DMA_TCD_TCD0_NBYTES_MLOFFYES_DMLOE_SHIFT
#define DMA_TCD_NBYTES_MLOFFYES_DMLOE(x)    DMA_TCD_TCD0_NBYTES_MLOFFYES_DMLOE(x)

#define DMA_TCD_NBYTES_MLOFFYES_SMLOE_MASK  DMA_TCD_TCD0_NBYTES_MLOFFYES_SMLOE_MASK
#define DMA_TCD_NBYTES_MLOFFYES_SMLOE_SHIFT DMA_TCD_TCD0_NBYTES_MLOFFYES_SMLOE_SHIFT
#define DMA_TCD_NBYTES_MLOFFYES_SMLOE(x)    DMA_TCD_TCD0_NBYTES_MLOFFYES_SMLOE(x)
/*! @} */

