rob-zeno/hal_nxp/s32/mcux/devices/S32K312/S32K312_device.h
/*! @name TCD_SLAST_SDA - TCD Last Source Address Adjustment / Store DADDR Address */
/*! @{ */

#define DMA_TCD_SLAST_SDA_SLAST_SDA_MASK    DMA_TCD_TCD0_SLAST_SDA_SLAST_SDA_MASK
#define DMA_TCD_SLAST_SDA_SLAST_SDA_SHIFT   DMA_TCD_TCD0_SLAST_SDA_SLAST_SDA_SHIFT
#define DMA_TCD_SLAST_SDA_SLAST_SDA(x)      DMA_TCD_TCD0_SLAST_SDA_SLAST_SDA(x)
/*! @} */

/*! @name TCD_DADDR - TCD Destination Address */
/*! @{ */

#define DMA_TCD_DADDR_DADDR_MASK            DMA_TCD_TCD0_DADDR_DADDR_MASK
#define DMA_TCD_DADDR_DADDR_SHIFT           DMA_TCD_TCD0_DADDR_DADDR_SHIFT
#define DMA_TCD_DADDR_DADDR(x)              DMA_TCD_TCD0_DADDR_DADDR(x)
/*! @} */

/*! @name TCD_DOFF - TCD Signed Destination Address Offset */
/*! @{ */

#define DMA_TCD_DOFF_DOFF_MASK              DMA_TCD_TCD0_DOFF_DOFF_MASK
#define DMA_TCD_DOFF_DOFF_SHIFT             DMA_TCD_TCD0_DOFF_DOFF_SHIFT
#define DMA_TCD_DOFF_DOFF(x)                DMA_TCD_TCD0_DOFF_DOFF(x)
/*! @} */

/*! @name TCD_CITER_ELINKNO - TCD Current Major Loop Count (Minor Loop Channel Linking Disabled) */
/*! @{ */

#define DMA_TCD_CITER_ELINKNO_CITER_MASK    DMA_TCD_TCD0_CITER_ELINKNO_CITER_MASK
#define DMA_TCD_CITER_ELINKNO_CITER_SHIFT   DMA_TCD_TCD0_CITER_ELINKNO_CITER_SHIFT
#define DMA_TCD_CITER_ELINKNO_CITER(x)      DMA_TCD_TCD0_CITER_ELINKNO_CITER(x)

#define DMA_TCD_CITER_ELINKNO_ELINK_MASK    DMA_TCD_TCD0_CITER_ELINKNO_ELINK_MASK
#define DMA_TCD_CITER_ELINKNO_ELINK_SHIFT   DMA_TCD_TCD0_CITER_ELINKNO_ELINK_SHIFT
#define DMA_TCD_CITER_ELINKNO_ELINK(x)      DMA_TCD_TCD0_CITER_ELINKNO_ELINK(x)
/*! @} */

/*! @name TCD_CITER_ELINKYES - TCD Current Major Loop Count (Minor Loop Channel Linking Enabled) */
/*! @{ */

#define DMA_TCD_CITER_ELINKYES_CITER_MASK  DMA_TCD_TCD0_CITER_ELINKYES_CITER_MASK
#define DMA_TCD_CITER_ELINKYES_CITER_SHIFT DMA_TCD_TCD0_CITER_ELINKYES_CITER_SHIFT
#define DMA_TCD_CITER_ELINKYES_CITER(x)    DMA_TCD_TCD0_CITER_ELINKYES_CITER(x)

#define DMA_TCD_CITER_ELINKYES_LINKCH_MASK  DMA_TCD_TCD0_CITER_ELINKYES_LINKCH_MASK
#define DMA_TCD_CITER_ELINKYES_LINKCH_SHIFT DMA_TCD_TCD0_CITER_ELINKYES_LINKCH_SHIFT
#define DMA_TCD_CITER_ELINKYES_LINKCH(x)    DMA_TCD_TCD0_CITER_ELINKYES_LINKCH(x)

#define DMA_TCD_CITER_ELINKYES_ELINK_MASK  DMA_TCD_TCD0_CITER_ELINKYES_ELINK_MASK
#define DMA_TCD_CITER_ELINKYES_ELINK_SHIFT DMA_TCD_TCD0_CITER_ELINKYES_ELINK_SHIFT
#define DMA_TCD_CITER_ELINKYES_ELINK(x)    DMA_TCD_TCD0_CITER_ELINKYES_ELINK(x)
/*! @} */

/*! @name TCD_DLAST_SGA - TCD Last Destination Address Adjustment / Scatter Gather Address */
/*! @{ */

#define DMA_TCD_DLAST_SGA_DLAST_SGA_MASK  DMA_TCD_TCD0_DLAST_SGA_DLAST_SGA_MASK
#define DMA_TCD_DLAST_SGA_DLAST_SGA_SHIFT DMA_TCD_TCD0_DLAST_SGA_DLAST_SGA_SHIFT
#define DMA_TCD_DLAST_SGA_DLAST_SGA(x)    DMA_TCD_TCD0_DLAST_SGA_DLAST_SGA(x)
/*! @} */

/*! @name TCD_CSR - TCD Control and Status */
/*! @{ */

#define DMA_TCD_CSR_START_MASK            DMA_TCD_TCD0_CSR_START_MASK
#define DMA_TCD_CSR_START_SHIFT           DMA_TCD_TCD0_CSR_START_SHIFT
#define DMA_TCD_CSR_START(x)              DMA_TCD_TCD0_CSR_START(x)

#define DMA_TCD_CSR_INTMAJOR_MASK         DMA_TCD_TCD0_CSR_INTMAJOR_MASK
#define DMA_TCD_CSR_INTMAJOR_SHIFT        DMA_TCD_TCD0_CSR_INTMAJOR_SHIFT
#define DMA_TCD_CSR_INTMAJOR(x)           DMA_TCD_TCD0_CSR_INTMAJOR(x)

#define DMA_TCD_CSR_INTHALF_MASK          DMA_TCD_TCD0_CSR_INTHALF_MASK
#define DMA_TCD_CSR_INTHALF_SHIFT         DMA_TCD_TCD0_CSR_INTHALF_SHIFT
#define DMA_TCD_CSR_INTHALF(x)            DMA_TCD_TCD0_CSR_INTHALF(x)

#define DMA_TCD_CSR_DREQ_MASK             DMA_TCD_TCD0_CSR_DREQ_MASK
#define DMA_TCD_CSR_DREQ_SHIFT            DMA_TCD_TCD0_CSR_DREQ_SHIFT
#define DMA_TCD_CSR_DREQ(x)               DMA_TCD_TCD0_CSR_DREQ(x)

#define DMA_TCD_CSR_ESG_MASK              DMA_TCD_TCD0_CSR_ESG_MASK
#define DMA_TCD_CSR_ESG_SHIFT             DMA_TCD_TCD0_CSR_ESG_SHIFT
#define DMA_TCD_CSR_ESG(x)                DMA_TCD_TCD0_CSR_ESG(x)

#define DMA_TCD_CSR_MAJORELINK_MASK       DMA_TCD_TCD0_CSR_MAJORELINK_MASK
#define DMA_TCD_CSR_MAJORELINK_SHIFT      DMA_TCD_TCD0_CSR_MAJORELINK_SHIFT
#define DMA_TCD_CSR_MAJORELINK(x)         DMA_TCD_TCD0_CSR_MAJORELINK(x)

#define DMA_TCD_CSR_EEOP_MASK             DMA_TCD_TCD0_CSR_EEOP_MASK
#define DMA_TCD_CSR_EEOP_SHIFT            DMA_TCD_TCD0_CSR_EEOP_SHIFT
#define DMA_TCD_CSR_EEOP(x)               DMA_TCD_TCD0_CSR_EEOP(x)

#define DMA_TCD_CSR_ESDA_MASK             DMA_TCD_TCD0_CSR_ESDA_MASK
#define DMA_TCD_CSR_ESDA_SHIFT            DMA_TCD_TCD0_CSR_ESDA_SHIFT
#define DMA_TCD_CSR_ESDA(x)               DMA_TCD_TCD0_CSR_ESDA(x)

#define DMA_TCD_CSR_MAJORLINKCH_MASK      DMA_TCD_TCD0_CSR_MAJORLINKCH_MASK
#define DMA_TCD_CSR_MAJORLINKCH_SHIFT     DMA_TCD_TCD0_CSR_MAJORLINKCH_SHIFT
#define DMA_TCD_CSR_MAJORLINKCH(x)        DMA_TCD_TCD0_CSR_MAJORLINKCH(x)

#define DMA_TCD_CSR_BWC_MASK              DMA_TCD_TCD0_CSR_BWC_MASK
#define DMA_TCD_CSR_BWC_SHIFT             DMA_TCD_TCD0_CSR_BWC_SHIFT
#define DMA_TCD_CSR_BWC(x)                DMA_TCD_TCD0_CSR_BWC(x)
/*! @} */

/*! @name TCD_BITER_ELINKNO - TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled) */
/*! @{ */

#define DMA_TCD_BITER_ELINKNO_BITER_MASK  DMA_TCD_TCD0_BITER_ELINKNO_BITER_MASK
#define DMA_TCD_BITER_ELINKNO_BITER_SHIFT DMA_TCD_TCD0_BITER_ELINKNO_BITER_SHIFT
#define DMA_TCD_BITER_ELINKNO_BITER(x)    DMA_TCD_TCD0_BITER_ELINKNO_BITER(x)

#define DMA_TCD_BITER_ELINKNO_ELINK_MASK  DMA_TCD_TCD0_BITER_ELINKNO_ELINK_MASK
#define DMA_TCD_BITER_ELINKNO_ELINK_SHIFT DMA_TCD_TCD0_BITER_ELINKNO_ELINK_SHIFT
#define DMA_TCD_BITER_ELINKNO_ELINK(x)    DMA_TCD_TCD0_BITER_ELINKNO_ELINK(x)
/*! @} */

/*! @name TCD_BITER_ELINKYES - TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled) */
/*! @{ */

#define DMA_TCD_BITER_ELINKYES_BITER_MASK  DMA_TCD_TCD0_BITER_ELINKYES_BITER_MASK
#define DMA_TCD_BITER_ELINKYES_BITER_SHIFT DMA_TCD_TCD0_BITER_ELINKYES_BITER_SHIFT
#define DMA_TCD_BITER_ELINKYES_BITER(x)    DMA_TCD_TCD0_BITER_ELINKYES_BITER(x)

#define DMA_TCD_BITER_ELINKYES_LINKCH_MASK  DMA_TCD_TCD0_BITER_ELINKYES_LINKCH_MASK
#define DMA_TCD_BITER_ELINKYES_LINKCH_SHIFT DMA_TCD_TCD0_BITER_ELINKYES_LINKCH_SHIFT
#define DMA_TCD_BITER_ELINKYES_LINKCH(x)    DMA_TCD_TCD0_BITER_ELINKYES_LINKCH(x)

#define DMA_TCD_BITER_ELINKYES_ELINK_MASK   DMA_TCD_TCD0_BITER_ELINKYES_ELINK_MASK
#define DMA_TCD_BITER_ELINKYES_ELINK_SHIFT  DMA_TCD_TCD0_BITER_ELINKYES_ELINK_SHIFT
#define DMA_TCD_BITER_ELINKYES_ELINK(x)     DMA_TCD_TCD0_BITER_ELINKYES_ELINK(x)
/*! @} */

#endif /* _S32K312_DEVICE_H_ */
